---
type: TextBox
namespace: Autodesk.Revit.UI
version: 2024
members: 7
tags: [revit-api, class]
---

# TextBox

`Autodesk.Revit.UI.TextBox` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Event | EnterPressed | — | `public event EventHandler < TextBoxEnterPressedEventArgs > EnterPressed` |
| Property | Image | 2011 | `public ImageSource Image { get ; set ; }` |
| Property | PromptText | 2011 | `public string PromptText { get ; set ; }` |
| Property | SelectTextOnFocus | 2011 | `public bool SelectTextOnFocus { get ; set ; }` |
| Property | ShowImageAsButton | 2011 | `public bool ShowImageAsButton { get ; set ; }` |
| Property | Value | 2011 | `public Object Value { get ; set ; }` |
| Property | Width | 2011 | `public double Width { get ; set ; }` |